[{"duration":"1 HOUR, 30 MINUTES","title":"A Study in Pink","story":"A war hero, invalided home from Afghanistan, meets a strange but charismatic genius who is looking for a flatmate; it is London, 2010, and Dr Watson and Sherlock Holmes are meeting for the first time. A string of impossible suicides has Scotland Yard baffled - and only one man can help.","images":["s01_ep01_01.jpeg","s01_ep01_02.jpeg"],"url":"http://www.bbc.co.uk/programmes/b00t8wp0"},{"duration":"1 HOUR, 30 MINUTES","title":"The Blind Banker","story":"A mysterious cipher is being scrawled on the walls around London. The first person to see the cipher is dead within hours of reading it. Sherlock plunges into a world of codes and symbols, consulting with London's best graffiti artists. He soon learns that the city is in the grip a gang of international smugglers, a secret society called the Black Lotus.","images":["s01_ep02_01.jpeg","s01_ep02_02.jpeg"],"url":"http://www.bbc.co.uk/programmes/b00tc6t2"},{"duration":"1 HOUR, 30 MINUTES","title":"The Great Game","story":"A strange clue in an empty room, a blood-soaked car, a priceless Old Master, a deranged bomber. With the clock ticking, the curtain rises on a battle of wits between Sherlock, John and the shadowy stranger who seems to know all the answers...","images":["s01_ep03_01.jpeg","s01_ep03_02.jpeg"],"url":"http://www.bbc.co.uk/programmes/b00tffft"},{"duration":"1 HOUR, 30 MINUTES","title":"A Scandal in Belgravia","story":"\"We are in Buckingham Palace, the very heart of the British nation - Sherlock Holmes, put your trousers on.\"\\nA case of blackmail threatens to topple the monarchy itself, but soon Sherlock and John discover there is even more to it than that. They find themselves battling international terrorism, rogue CIA agents, and a secret conspiracy involving the British government.\\nBut this case will cast a longer shadow on their lives than they could ever imagine, as the great detective begins a long duel of wits with an antagonist as cold and ruthless and brilliant as himself: Irene Adler.","images":["s02_ep01_01.jpeg","s02_ep01_02.jpeg"],"url":"http://www.bbc.co.uk/programmes/p00m5wm9"},{"duration":"1 HOUR, 30 MINUTES","title":"The Hounds of Baskerville","story":"Something terrible has happened to Henry Knight; Sherlock and John investigate the truth about the monstrous creature which apparently killed their client's father. A hound from hell? What seems like fantasy in Baker Street is a very different prospect in the ultra-secret army base that looms over Dartmoor.","images":["s02_ep02_01.jpeg","s02_ep02_02.jpeg"],"url":"http://www.bbc.co.uk/programmes/b019h2f9"},{"duration":"1 HOUR, 30 MINUTES","title":"The Reichenbach Fall","story":"James Moriarty possesses the greatest criminal mind that the world has ever seen. Sherlock and John knew he wouldn't stay hidden for long. But even they never guessed the sheer scale and audacity of the crime that would propel Moriarty back into the headlines. The crime of the century. The Tower of London, the Bank of England and Pentonville prison - all sprung open on the same day, as if by magic! But Moriarty's plans don't stop there...\n\nSherlock and John lock horns with their old enemy in one final problem that tests loyalty and courage to their very limits. Sherlock must fight for his reputation, his sanity and his life. But is he all he claims to be?","images":["s02_ep03_01.jpeg","s02_ep03_02.jpeg"],"url":"http://www.bbc.co.uk/programmes/b01b2vl4"}]